{
  "IJARAH": [
    {
      "query": "Ijarah MBT Accounting (in Lessee’s books)\nOn 1 January 2019 Alpha Islamic bank (Lessee) entered into an Ijarah MBT arrangement with\nSuper Generators for Ijarah of a heavy-duty generator purchase by Super Generators at a price\nof USD 450,000.\nSuper Generators has also paid USD 12,000 as import tax and US 30,000 for freight charges.\nThe Ijarah Term is 02 years and expected residual value at the end USD 5,000. At the end of\nIjarah Term, it is highly likely that the option of transfer of ownership of the underlying asset to\nthe lessee shall be exercised through purchase at a price of USD 3,000.\nAlpha Islamic Bank will amortize the ‘right of use’ on yearly basis and it is required to pay yearly\nrental of USD 300,000.\nProvide the following accounting entry in the books of Alpha Islamic Bank:\nInitial Recognition at the time of commencement of Ijarah (using Underlying Asset Cost\nMethod). ",
      "response": "The journal entry recognizes the lessee's right to use the generator (ROU Asset) at its prime cost of USD 492,000. The Deferred Ijarah Cost of USD 108,000 represents the financing cost embedded in the lease, which will be amortized over the lease term. The Ijarah Liability of USD 600,000 reflects the total obligation for future lease payments (2 years * USD 300,000). The amortizable amount of USD 490,000 reflects the ROU asset adjusted for the difference between the residual value and the purchase option price, representing the portion of the asset's value that will be consumed during the lease term."
    },
    {
      "query": "On 1 January 2025, Noor Islamic Finance (Lessee) entered into an Ijarah MBT arrangement with Global HeavyTech Ltd. for the Ijarah of an industrial 3D printing machine purchased by Global HeavyTech at a price of USD 500,000.\n\nIn addition to the purchase price, Global HeavyTech also incurred:\n\nImport tax of USD 15,000\n\nFreight charges of USD 25,000\n\nThe total Prime Cost of the asset amounts to USD 540,000.\n\nThe Ijarah Term is 3 years.\n\nThe residual value of the asset at the end of the term is estimated at USD 10,000.\n\nIt is highly probable that Noor Islamic Finance will exercise the purchase option at the end of the term for USD 6,000.\n\nNoor Islamic Finance is required to pay annual rentals of USD 200,000.\n\nThe Right of Use (ROU) asset will be amortized annually over the Ijarah term.",
      "response": "------------------------------\n**Transaction Type:** Ijarah Muntahia Bittamleek (Lease ending with ownership)  \n**Applicable Standard:** AAOIFI FAS 28  \n**Accounting Method:** Underlying Asset Cost Method  \n\n**EXTRACTED VARIABLES**  \n------------------------------\n- **Purchase Price:** USD 500,000  \n- **Import Tax:** USD 15,000  \n- **Freight Charges:** USD 25,000  \n- **Prime Cost:** USD 540,000  \n- **Lease Term:** 3 years  \n- **Residual Value:** USD 10,000  \n- **Purchase Option Price:** USD 6,000  \n- **Annual Rental:** USD 200,000  \n\n**"
    }
  ]
}